# 1) Исправить код по PEP
print ('It is\'not good code')

# 2) Посчитать, сколько строк выведет код
print("line 1")
# print("line 2")
print("line 3")  # print("line 4")

# 3) Вывести типы следующих объектов:
# "int"
# 394
# 2.12

# 4) Нужно вывести число 99.99. Оно не используется для арифметических операций.
# Какими типами можно воспользоваться?

# 5) Что выведет этот код?
print(type("3.1415"))

# 6) Вывести следующую конструкцию
# '
# '"'
# '"'"'
# '"'"'"'

# 7) Что выведет следующий код?
print('One')
print()
print("""Two

Three""")
print("")
print("Four")

# 8) Данные какого типа хранит переменная b?
a = "Tuesday"
b = 10
a = b
b = a

# 9) Определить значение c, не запуская код
a = 10
b = 20
c = 30
a = c
b = a
d = c
c = a

# 10) Что будет, если обратиться к переменной без значения?

# 11) Найти ошибки в коде. Создается строка и проверяется её тип
ost = Happy
print(type_of(0st))

# 12) Даны переменные
a = 50
b = 5
c = 10
# Нужно сделать присваивания так, чтобы переменные хранили следующие значения
# a = 50
# b = 5
# c = 10
# но присваивания можно делать только между самими переменными, т.е.
# допустимо:
# a = b
# b = c и т.д.
# недопустимо:
# a = 50
# b = 5

# 13) Что выведет следующий код?
print("Enter a number: ")
user_num = input()
# пользователь вводит 10
print(user_num + user_num)

# 14) Написать программу, которая считывает две десятичные дроби и выводит их сумму
# 15) На вход подается сначало число n, а потом слово word. Нужно вывести слово word n раз.
# Пример входных данных:
# 7
# la
# Пример выходных данных:
# lalalalalalala

# 16) Считать строку и создать из неё список
# 17) Исправить код так, чтобы он создавал список из одного элемента
name = list('Helen')
print(name)

# 18) Выбрать корректный список
# [5, 6, 7, "8"}
#
# [1, '2', 3, "4"]
#
# [1 2 3 4 5]
#
# ('1', 2, 3, '4')

# 19) Дан список, получаемый из ввода
hidden = list(input())
# Вывести его длину
